app/controllers/produtos_controller.rb

SELECT  "produtos".* FROM "produtos"  ORDER BY "produtos"."nome" ASC LIMIT 5
SELECT "produtos".* FROM "produtos"  ORDER BY "produtos"."preco" ASC
---
    def index
        @produtos_por_nome = Produto.order(:nome).limit 5
        @produtos_por_preco = Produto.order :preco

SELECT "departamentos".* FROM "departamentos"
---
    def new
        @produto = Produto.new
        @departamentos = Departamento.all

INSERT INTO "produtos" ("nome", "preco", "descricao", "quantidade", "departamento_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["nome", "teste"], ["preco", 2.0], ["descricao", "teste"], ["quantidade", 1], ["departamento_id", 1], ["created_at", "2018-09-06 14:20:01.887405"], ["updated_at", "2018-09-06 14:20:01.887405"]]
SELECT "departamentos".* FROM "departamentos"
---
    def create
        valores = params.require(:produto).permit :nome, :preco, :descricao, :quantidade, :Departamento_id
        @produto = Produto.new valores
        puts "*"*100
        puts @produto

        if @produto.save
            flash[:notice] = "Produto salvo com sucesso"
            redirect_to root_url
        else
            @departamentos = Departamento.all

DELETE FROM "produtos" WHERE "produtos"."id" = ?  [["id", 6]]
---
    def destroy
        id = params[:id]
        Produto.destroy id

SELECT "produtos".* FROM "produtos" WHERE (nome like '%camise%')
---
    def busca
        @nome_a_buscar = params[:nome]
        @produtos = Produto.where "nome like ?", "%#{@nome_a_buscar}%"

SELECT "departamentos".* FROM "departamentos"
---
    def edit
        id = params[:id]
        @produto = Ṕroduto.find(id)
        @departamentos = Departamento.all

SELECT  "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT 1  [["id", 11]]
UPDATE "produtos" SET "quantidade" = ?, "departamento_id" = ?, "updated_at" = ? WHERE "produtos"."id" = ?  [["quantidade", 1020], ["departamento_id", 1], ["updated_at", "2018-09-06 14:08:40.173014"], ["id", 11]]
---
    def update
        id = params[:id]
        @produto = Produto.find(id)
        valores = params.require(:produto).permit :nome, :preco, :descricao, :quantidade, :Departamento_id
        if @produto.update valores